{"data":[
    {
      "name": "Bond Smith",
      "title": "Defensive Coordinator",
      "bio": "TBD",
      "imagelocation": "imgs/coaches/freshman/Bond_Smith.jpg"
    },
    {
      "name": "Carlos William",
      "title": "Assistant",
      "bio": "4 year football and baseball player. 2 year All-State in football, 3 year All-Region. Went to Ole Miss on baseball scholarship and then transferred to Memphis to play football in Fall of 2014. Won Miami Beach bowl with UofM. For baseball set a Tennessee prep state record with 185 career stolen bases for baseball ... Ran a 6.18 60 yard dash at perfect game showcase. Also established a state high school record for consecutive steals (120) and the national record for being hit by a pitch (60) ... Baseball accomplishments resulted in recognition from Sports Illustrated&#39;s Faces In The Crowd feature ... The Baseball Draft Report listed him on the site&#39;s list of Top 75 High School Outfield Prospects (No. 47) ... Two-way player on the gridiron at Covington High School who helped lead the Chargers to the 4A state football championship game as a senior ... Marty Wheeler-coached Covington team posted a 15-1 record in 2012 and captured the AA District 13 title with a 9-0 mark.",
      "imagelocation": "imgs/coaches/nocoachpng.png"
    },
    {
      "name": "Patrick Elam",
      "title": "Defensive Backs",
      "bio": "Patrick is a graduate of the University of Central Arkansas, where he earned a football scholarship and won a National Championship in 1991. He was also inducted into the Arkansas Sports Hall of Fame in October 2017. Patrick has coached many of our current players during their younger years in little league. Patrick has been coaching Freshman football at Collierville High School for the past 3 years and is currently the defensive back coach this year as well as assisting with the varsity defensive backs.",
      "imagelocation": "imgs/coaches/freshman/Patrick_Elam.jpg"
    },
    {
      "name": "Leonard Floyd",
      "title": "Wide Receivers/Defensive Linemen",
      "bio": "Leonardo (Leon) Floyd native of Ocala Florida where he attended Forest High School where he played football for four years as a wide receiver and defensive back. After graduating from high school in 1979, he received a scholarship to Tennessee State University(TSU) Nashville, TN where he lettered four years as a wide receiver. After completing his college career he was drafted by the Memphis Showboats of the United States Football League (USFL) where he was a member during 1984 and 1985 seasons. During the fall of 1984, he returned TSU where he served as a Graduate Assistant (GA) Coach. As a &quot;GA&quot; he coached quarterbacks and receivers. During that season, the team successfully went 11-0. In 1986, Coach Floyd joined the staff at Albany State University, where he served as the Offensive Coordinator and coached quarterbacks and receivers. Coach Floyd, after leaving coaching he began a career of more than 20 years with the Federal Government. Coach Floyd returned to coaching in 2016 as the receiver coach for the Collierville Dragons&#39; Eighth Grade Team. In the 2017 and 2018 seasons, he was a member of the staff of the Ninth Grade (Freshman) Collierville Dragons Teams. As a part of Ninth Grade staff, he coached receivers and defensive backs. In 2019, Coach Floyd will return to the Ninth Grade staff and he will assist with the varsity team on Friday nights.",
      "imagelocation": "imgs/coaches/freshman/Leon_Floyd.jpg"
    },
    {
      "name": "aisibleBlake Bennett",
      "title": "QB/RB Coach",
      "bio": "2014 MUS grad. 4 year football(QB) and baseball player Ole miss baseball 2014-2015 Itawamba CC 2015-2016 U of Memphis 2016-2018 Undrafted Free Agent sign by Philadelphia Phillies in 2018 Dad (Dave) played football at Tennessee from 1988-1992 (strong safety) Passed away in 2013 from ALS Will be marrying fiancé Madison in October 2019 Mom (Paige) and stepdad (Mark) live in Oxford, MS. Have 1 brother (Riley, 19) and 4 stepbrothers (Mark, 24,, Adam, 21,, Will, 20,,Cole, 17)",
      "imagelocation": "imgs/coaches/freshman/Blake_Bennett.jpg"
    },
    {
      "name": "John White",
      "title": "Head Freshmen Coach",
      "bio": "TBD",
      "imagelocation": "imgs/coaches/freshman/John_White.jpg"
    }
  ]}